[ { "_id": "sa-1",
    "title": { "pt-br": "SA-1", "en": "SA-1" },
    "type": "chip",
    "text": { "pt-br": "O chip SA-1 foi uma expansão para dificultar a pirataria e expandir a capacidade do cartucho. Ele trazia compactador de conteúdo (que aumentava a densisdade de dados no cartucho) e um chip idêntico ao do núcleo do SNES, um processador 65816, mas num `clock´ mais rápido que o do próprio SNES, além de customizações que otimizavam cada jogo onde ele estava. Foi usado em alguns jogos sofisticados, como SuperMarioRPG e Kirby Dream Land 3 e em muitos jogos que requeriam operações matemáticas mais profundas, como vários cartuchos japoneses de Shogi." } },
  { "_id": "dsp-1",
    "title": { "pt-br": "DSP-1", "en": "DSP-1" },
    "type": "chip",
    "text": { "pt-br": "DSP é sigla de Digital Signal Processor (processador de sinais digitais) e é nada mais que um chip que auxilia em operações matemáticas, possibilitando que os jogos usem mais processamento matemático e sejam por consequência mais rápidos e complexos. Houve versões `corrigidas´ do chip, chamadas DSP-1A e DSP-1B, mas são meras atualizações, sem diferenças notáveis." } },
  { "_id": "dsp-2",
    "title": { "pt-br": "DSP-2", "en": "DSP-2" },
    "type": "chip",
    "text": { "pt-br": "Um tipo de chip que atua como processador matemático auxiliar (Digital Signal Processor) encontrado apenas no jogo Dungeon Master." } },
  { "_id": "dsp-3",
    "title": { "pt-br": "DSP-3", "en": "DSP-3" },
    "type": "chip",
    "text": { "pt-br": "Chip processador matemático auxiliar (Digital Signal Processor) e que também tem funções anti-pirataria, supostamente um chip especial da Bandai, usado apenas no jogo SD Gundam GX." } },
  { "_id": "dsp-4",
    "title": { "pt-br": "DSP-4", "en": "DSP-4" },
    "type": "chip",
    "text": { "pt-br": "Chip de processamento matemático auxiliar e com função anti-pirataria, feito para aumentar a capacidade nativa do console e usado apenas no jogo Top Gear 3000." } },
  { "_id": "c4",
    "title": { "pt-br": "C4", "en": "C4" },
    "type": "chip",
    "text": { "pt-br": "Chip de processamento matemático auxiliar que permitia alguns efeitos adicionais, como efeitos de rotação e escala mais avançados que os nativos do SNES (MODE7) e gráficos tridimensionais simples sem preenchimento (`wireframe´). Chip criado pela Capcom e usado apenas nos jogos Megaman(Rockman) X2 e X3." } },
  { "_id": "superfx",
    "title": { "pt-br": "SuperFX", "en": "SuperFX" },
    "type": "chip",
    "text": { "pt-br": "Chip que permitiu uma pequena revolução nos games, dando ao SuperNES (na verdade, aos jogos que tinham o chip) capacidade de mostrar gráficos em 3D gerados em tempo real. Era um chip RISC rodando em clock de 10.5 a 21 MHz, muitas vezes mais rápido que o processador central do SNES." } },
  { "_id": "superfx2",
    "title": { "pt-br": "SuperFX2", "en": "SuperFX2" },
    "type": "chip",
    "text": { "pt-br": "Atualização do chip que permitia aos jogos que o tinham gerar gráficos em 3D real. Essa versão do chip foi usada em três jogos somente (Yoshi´s Island, Doom e Winter Gold FX), e permitia mais dados no cartucho (até 32Mb, contra até 8Mb do SuperFX normal)." } },
  { "_id": "setadsp",
    "title": { "pt-br": "SetaDSP", "en": "SetaDSP" },
    "type": "chip",
    "text": { "pt-br": "Chip de processamento matemático auxiliar ao console, que, como o nome denota, é exclusivo da Seta. Também conhecido como Seta 10 ou ST010." } },
  { "_id": "s-dd1",
    "title": { "pt-br": "S-DD1", "en": "S-DD1" },
    "type": "chip",
    "text": { "pt-br": "Chip (também chamado -erradamente- SDD-1) que comprime e descomprime os dados dos cartuchos em tempo de execução, fazendo com que os cartuchos com este chip tenham mais informação em menos módulos de memória, além de fazer algumas otimizações gráficas. Segundo consta, é um chip tipo ASIC (Application Specific Intergrated Circuit) desenvolvido pela Ricoh." } },
  { "_id": "spc7110",
    "title": { "pt-br": "SPC7110", "en": "SPC7110" },
    "type": "chip",
    "text": { "pt-br": "Chip que, segundo consta, permite principalmente a compressão de dados em cartuchos, com fins de otimizar o espaço na memória do cartucho (e consequentemente ter jogos mais complexos) e dificultar a pirataria." } },
  { "_id": "obc-1",
    "title": { "pt-br": "OBC-1", "en": "OBC-1" },
    "type": "chip",
    "text": { "pt-br": "Chip que expande a capacidade de processamento dos sprites (elementos móveis na tela) do SNES. Usado apenas no jogo Metal Combat." } },
  { "_id": "setarisc",
    "title": { "pt-br": "SetaRISC", "en": "Seta RISC" },
    "type": "chip",
    "text": { "pt-br": "Também conhecido como Seta18, chip RISC que provavelmente aumentava a capacidade matemática do jogo e atuava como um fator anti-pirataria." } },
  { "_id": "internal-clock",
    "title": { "pt-br": "Relógio interno", "en": "Internal clock" },
    "type": "chip",
    "text": { "pt-br": "Consiste em um relógio que guarda o tempo real inserido em um chip no cartucho (também conhecido como S-RTC), que permite sincronizações da hora e data do tempo do jogo com o tempo `real´." } },
  { "_id": "barcode-battler",
    "title": { "pt-br": "Barcode Battler", "en": "Barcode Battler" },
    "type": "peripheral",
    "text": { "pt-br": "O Barcode Battler consistia em um sistema que, como o nome aponta, escaneia um código de barras e dele faz uma variação que resulta ou em um jogo único em sua pequena tela de cristal líquido, ou então, conectado ao Super NES, em uma variante no jogo que suporta o aparelho." } },
  { "_id": "nintendo-power",
    "title": { "pt-br": "Nintendo Power", "en": "Nintendo Power" },
    "type": "peripheral",
    "text": { "pt-br": "O sistema Nintendo Power foi um sistema composto por um cartucho recarregável como o da foto (o SF Memory Cassete, como na foto) e vários quiosques onde o jogador pagava uma taxa e `carregava´ o cartucho com um jogo. Muitos jogos populares estavam disponíveis pelo serviço, e no cartucho cabiam geralmente vários jogos (tinha 32Mb no total), que ficavam sendo selecionáveis por um menu. Inclusive alguns jogos foram exclusivos do sistema, que repetia o esquema do sistema FDS do NES e esteve no ar até o ano 2000." } },
  { "_id": "satellaview",
    "title": { "pt-br": "Satellaview", "en": "Satellaview" },
    "type": "peripheral",
    "text": { "pt-br": "Um sistema ´add-on´ (adicional) feito pela Bandai e conectado embaixo do SNES (Super Famicom, no caso), que permitia ao jogador se conectar a uma rede (rede da St.Giga) e participar de jogos on-line por períodos limitados de tempo, além de, em alguns casos, dar download de jogos via rede e guardá-los em um cartucho, num esquema semelhante ao Nintendo Power (embora totalmente on-line). Nintendo e Square deram amplo suporte ao sistema e para ele lançaram vários jogos." } },
  { "_id": "sufami-turbo",
    "title": { "pt-br": "Sufami Turbo", "en": "Sufami Turbo" },
    "type": "peripheral",
    "text": { "pt-br": "Sistema feito pela Bandai, que consistia de um adaptador para dois pequenos cartuchos que eram como jogos comuns (mas mais simples geralmente) que podiam ser jogados sozinhos mas se combinavam, e a combinação resultava em um novo jogo. O sistema, por ter dentro de si muitos dos componentes de um cartucho, barateava o custo dos jogos em si." } },
  { "_id": "super-scope",
    "title": { "pt-br": "Bazuca", "en": "Super Scope" },
    "type": "peripheral",
    "text": { "pt-br": "A bazuca do SNES, chamada oficialmente Super Scope, foi a tentativa de continuação do sucesso da pistola do NES. Ao contrário desta, era grande e, embora alguns a achem bonita, era bem desajeitada. Meia dúzia de jogos foram lançados para ela, sendo o problema talvez o fato de que os jogos estavam ganhando mais e mais complexidade e jogos para a bazuca são fundamentalmente jogos simples." } },
  { "_id": "justifier",
    "title": { "pt-br": "Justifier", "en": "Justifier" },
    "type": "peripheral",
    "text": { "pt-br": "A Justifier (Justice Fire no Japão) era uma pistola de luz para uso nos jogos. Também era chamada Lethal Enforcer Gun, por ser usada no SNES apenas no jogo Lethal Enforcer. É considerado um item bastante raro hoje por ter tido poucos exemplares fabricados. Segundo alguns relatos na Internet, era uma pistola muito melhor que a bazuca SuperScope, bastante leve e precisa, além de motivo de controvérsia dado seu design realista." } },
  { "_id": "mouse",
    "title": { "pt-br": "Mouse", "en": "Mouse" },
    "type": "peripheral",
    "text": { "pt-br": "O Mouse do SNES foi lançado como uma opção adicional de controle no console. Era pequeno e `bojudo´ em relação aos mouses comuns de hoje, mas não tinha grandes problemas. Foi a estrela da era `pré-paintbrush´ com Mario Paint, e foi usado em um número considerável de jogos japoneses de RPG, estratégia e tabuleiro." } },
  { "_id": "multitap",
    "title": { "pt-br": "Multitap", "en": "Multitap" },
    "type": "peripheral",
    "text": { "pt-br": "O multitap foi um acessório que permitia mais de dois jogadores interagindo no mesmo jogo, por meio de um adaptador que transformava uma saída para controles em quatro saídas. Não era da Nintendo, mas foi feito por algumas empresas, sendo o multitap mais popular o da Hudson. Muito popular em jogos de esporte, teve correspondentes em muitos outros consoles (fora aqueles, como o N64, que já tinham 4 saídas de controles." } },
  { "_id": "3d-glasses",
    "title": { "pt-br": "Oculos3D", "en": "3D glasses" },
    "type": "peripheral",
    "text": { "pt-br": "Não há muito segredo sobre este item, dado que seria apenas um trivial óculos 3D de celofane (papel transparente colorido), como os que todos conhecemos. Jim Powers foi o único jogo otimizado para este tipo de recurso no SNES." } },
  { "_id": "turbo-file",
    "title": { "pt-br": "Turbo File", "en": "Turbo File" },
    "type": "peripheral",
    "text": { "pt-br": "Também conhecido como TurboFile Twin, era um acessório feito pela ASCII e com suporte a alguns jogos desta empresa, que permitia um gerenciamento sobre arquivos `salvos´ de jogos (além de ter sua própria memória), como nos cartões de memória dos consoles mais modernos." } },
  { "_id": "x-band",
    "title": { "pt-br": "X-Band", "en": "X-Band" },
    "type": "peripheral",
    "text": { "pt-br": "Aparelho lançado pela Catapult nos EUA para o SNES, que consistia basicamente num modem (encaixado na entrada de cartuchos) onde jogadores podiam se enfrentar à distância via rede telefônica, além de compartilhar uma pequena base de informações. Havia também um teclado para ser usado em poucas aplicações específicas (nenhum jogo suporta o teclado do X-Band)." } } 